resources/benchmark/synthetic/lb/results/noistio.txt
NAME                             READY   STATUS    RESTARTS   AGE
service0-5fbfb4558b-89b4m        1/1     Running   0          11s
service1-6bf79894d8-67dbf        1/1     Running   0          11s
service1-busy-654d9b755f-l8sv7   1/1     Running   0          11s
Running 30s test @ http://10.97.146.177/endpoint1
  4 threads and 16 connections
  Thread calibration: mean lat.: 69.339ms, rate sampling interval: 227ms
  Thread calibration: mean lat.: 68.595ms, rate sampling interval: 226ms
  Thread calibration: mean lat.: 82.969ms, rate sampling interval: 226ms
  Thread calibration: mean lat.: 69.925ms, rate sampling interval: 226ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    73.43ms   44.80ms 118.53ms   56.54%
    Req/Sec    11.91      5.20    17.00     88.64%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  111.81ms
 75.000%  112.89ms
 90.000%  113.34ms
 99.000%  114.56ms
 99.900%  115.90ms
 99.990%  118.59ms
 99.999%  118.59ms
100.000%  118.59ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      20.015     0.000000            1         1.00
      21.743     0.100000          105         1.11
      22.271     0.200000          206         1.25
      22.607     0.300000          301         1.43
      23.167     0.400000          401         1.67
     111.807     0.500000          505         2.00
     112.191     0.550000          561         2.22
     112.383     0.600000          606         2.50
     112.575     0.650000          654         2.86
     112.767     0.700000          718         3.33
     112.895     0.750000          756         4.00
     113.023     0.775000          807         4.44
     113.023     0.800000          807         5.00
     113.087     0.825000          826         5.71
     113.151     0.850000          851         6.67
     113.215     0.875000          877         8.00
     113.279     0.887500          894         8.89
     113.343     0.900000          906        10.00
     113.407     0.912500          922        11.43
     113.471     0.925000          929        13.33
     113.535     0.937500          948        16.00
     113.535     0.943750          948        17.78
     113.599     0.950000          957        20.00
     113.663     0.956250          963        22.86
     113.727     0.962500          968        26.67
     113.791     0.968750          976        32.00
     113.791     0.971875          976        35.56
     113.791     0.975000          976        40.00
     113.983     0.978125          982        45.71
     114.047     0.981250          984        53.33
     114.303     0.984375          988        64.00
     114.303     0.985938          988        71.11
     114.367     0.987500          989        80.00
     114.559     0.989062          991        91.43
     114.623     0.990625          992       106.67
     114.879     0.992188          995       128.00
     114.879     0.992969          995       142.22
     114.879     0.993750          995       160.00
     115.071     0.994531          997       182.86
     115.071     0.995313          997       213.33
     115.455     0.996094          998       256.00
     115.455     0.996484          998       284.44
     115.455     0.996875          998       320.00
     115.775     0.997266          999       365.71
     115.775     0.997656          999       426.67
     115.903     0.998047         1000       512.00
     115.903     0.998242         1000       568.89
     115.903     0.998437         1000       640.00
     115.903     0.998633         1000       731.43
     115.903     0.998828         1000       853.33
     118.591     0.999023         1001      1024.00
     118.591     1.000000         1001          inf
#[Mean    =       73.428, StdDeviation   =       44.802]
#[Max     =      118.528, Total count    =         1001]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1504 requests in 30.02s, 233.53KB read
Requests/sec:     50.09
Transfer/sec:      7.78KB
Check lines for pod service0-5fbfb4558b-89b4m
1504
Check lines for pod service1-6bf79894d8-67dbf
658
Check lines for pod service1-busy-654d9b755f-l8sv7
846